# OLDGetLoadDataStr

## Description
Using selector, gets load data with string value for the parametric object

```pascal
FUNCTION OLDGetLoadDataStr(
				handle    : HANDLE;
				selector  : INTEGER;
				loadIndex : INTEGER) : STRING;
```

```python

def vs.OLDGetLoadDataStr(handle, selector, loadIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|selector|INTEGER||
|loadIndex|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis